app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.microposts.any? %>
---
SELECT  1 AS one FROM `microposts` WHERE `microposts`.`user_id` = 1 LIMIT 1

  color: turquoise;
  font-size: 3em">Microposts (<%= @user.microposts.count %>)</h3>
---
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1