app/helpers/sessions_helper.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def current_user
      if (user_id = session[:user_id])
        @current_user ||= User.find_by(id: user_id)
      elsif (user_id = cookies.signed[:user_id])
        user = User.find_by(id: user_id)

SELECT  `clothes`.* FROM `clothes` WHERE `clothes`.`id` IS NULL LIMIT 1
---
    def current_clothe
      if (clothe_id = session[:clothe_id])
        @current_clothe ||= Clothe.find_by(id: clothe_id)
      elsif (user_id = cookies.signed[:user_id])
        clothe = Clothe.find_by(id: clothe_id)