app/controllers/clothes_controller.rb

  def index
    @clothes = if params[:term]
    Clothe.where('name LIKE ?', "%#{params[:term]}%")
    else
    @clothes = Clothe.all
---
SELECT ((ts_headline('simple', (coalesce(`clothes`.`name`::text, '')), (to_tsquery('simple', '\' ' || 'quang' || ' \'' || ':*')), 'StartSel = \"<b>\", StopSel = \"\"'))) AS pg_search_highlight, clothes.* FROM `clothes` INNER JOIN (SELECT `clothes`.`id` AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce(`clothes`.`name`::text, ''))), (to_tsquery('simple', '\' ' || 'quang' || ' \'' || ':*')), 0)) AS rank FROM `clothes` WHERE ((to_tsvector('simple', coalesce(`clothes`.`name`::text, ''))) @@ (to_tsquery('simple', '\' ' || 'quang' || ' \'' || ':*')))) AS pg_search_5c5f9b87778cfb103aa03e ON `clothes`.`id` = pg_search_5c5f9b87778cfb103aa03e.pg_search_id ORDER BY pg_search_5c5f9b87778cfb103aa03e.rank DESC, `clothes`.`id` ASC
SELECT `clothes`.* FROM `clothes`

  def show
  @clothe = Clothe.find(params[:id])
---
SELECT  `clothes`.* FROM `clothes` WHERE `clothes`.`id` = 1 LIMIT 1

  def create
    @clothe = Clothe.new(clothe_params)
    if @clothe.save
---
INSERT INTO `clothes` (`name`, `gia`, `soluong`, `created_at`, `updated_at`, `picture`) VALUES ('gh', '100000', '12222', '2019-06-21 06:23:27', '2019-06-21 06:23:27', 'hinh-dep-11.jpg')