app/controllers/microposts_controller.rb

INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`, `picture`) VALUES ('hi', 1, '2019-06-18 09:42:54', '2019-06-18 09:42:54', 'hinh-dep-11.jpg')
---
    def create
      @micropost = current_user.microposts.build(micropost_params)
      if @micropost.save