app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'vumhquangg@gmail.com' LIMIT 1

  def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE `users` SET `password_digest` = '$2a$10$/cAwOhMKAARauRaM2GteBeTqFU4hfp1wOajn6Hbj7JuctJwVoC/vS', `updated_at` = '2019-06-18 07:25:45' WHERE `users`.`id` = 1

    def get_user
      @user = User.find_by(email: params[:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'vumhquangg@gmail.com' LIMIT 1