app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 1 ORDER BY `microposts`.`created_at` DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `activation_digest`) VALUES ('Quang', 'quangly1997@gmail.com', '2019-06-18 06:22:54', '2019-06-18 06:22:54', '$2a$10$b5a9Vfa86EfmAk3Bfvcb7Oq2YR192hAVLO3sWWbwqpBD/t2/OU/1C', '$2a$10$T/E1dETkB9tt2Ogzf7cesuI1x8qKdUON9FqySVDaEbJVlPFGSCadu')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page])

DELETE FROM `users` WHERE `users`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def destroy
    User.find(params[:id]).destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 101 LIMIT 1
---
    def correct_user
      @user = User.find(params[:id])